---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
source: html/5daf217d-f04f-5878-7245-a0420d2ff797.htm
---
# DocumentCreatingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.